Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_356.0.xml
<module id="SYSCTL" HW_revision="356.0">
    <register id="SYS_REBOOT_CTL" width="32" offset="0x0" internal="0" description="Reboot Control Register">
        <bitfield id="REBOOT" description="Write 1 initiates a Reboot of the device" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WKEY" description="Key to enable writes to bit 0" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_NMI_CTLSTAT" width="32" offset="0x4" internal="0" description="NMI Control and Status Register">
        <bitfield id="CS_SRC" description="CS interrupt as a source of NMI" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables CS interrupt as a source of NMI"/>
            <bitenum id="ENABLE" value="0x1" description="Enables CS interrupt as a source of NMI"/>
        </bitfield>
        <bitfield id="PSS_SRC" description="PSS interrupt as a source of NMI" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables the PSS interrupt as a source of NMI"/>
            <bitenum id="ENABLE" value="0x1" description="Enables the PSS interrupt as a source of NMI"/>
        </bitfield>
        <bitfield id="PCM_SRC" description="PCM interrupt as a source of NMI" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disbles the PCM interrupt as a source of NMI"/>
            <bitenum id="ENABLE" value="0x1" description="Enables the PCM interrupt as a source of NMI"/>
        </bitfield>
        <bitfield id="PIN_SRC" description="RSTn/NMI pin configuration Note: When the device enters LPM3/LPM4 modes of operation, the functionality selected by this bit is retained. If selected as an NMI, activity on this pin in  LPM3/LPM4 wakes the device and processes the interrupt, without causing a POR. If selected as a Reset, activity on this pin in LPM3/LPM4 causes a device-level POR When the device enters LPM3.5/LPM4.5 modes of operation, this bit is always cleared to 0. In other words, the RSTn/NMI pin always assumes a reset functionality in LPM3.5/LPM4.5 modes." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="POR" value="0x0" description="Configures the RSTn_NMI pin as a source of POR Class Reset"/>
            <bitenum id="NMI" value="0x1" description="Configures the RSTn_NMI pin as a source of NMI"/>
        </bitfield>
        <bitfield id="CS_FLG" description="CS interrupt was the source of NMI" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="CS_FLG_0" value="0x0" description="indicates CS interrupt was not the source of NMI"/>
            <bitenum id="CS_FLG_1" value="0x1" description="indicates CS interrupt was the source of NMI"/>
        </bitfield>
        <bitfield id="PSS_FLG" description="PSS interrupt was the source of NMI" begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="PSS_FLG_0" value="0x0" description="indicates the PSS interrupt was not the source of NMI"/>
            <bitenum id="PSS_FLG_1" value="0x1" description="indicates the PSS interrupt was the source of NMI"/>
        </bitfield>
        <bitfield id="PCM_FLG" description="PCM interrupt was the source of NMI" begin="18" end="18" width="1" rwaccess="R">
            <bitenum id="PCM_FLG_0" value="0x0" description="indicates the PCM interrupt was not the source of NMI"/>
            <bitenum id="PCM_FLG_1" value="0x1" description="indicates the PCM interrupt was the source of NMI"/>
        </bitfield>
        <bitfield id="PIN_FLG" description="RSTn/NMI pin was the source of NMI" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="PIN_FLG_0" value="0x0" description="Indicates the RSTn_NMI pin was not the source of NMI"/>
            <bitenum id="PIN_FLG_1" value="0x1" description="Indicates the RSTn_NMI pin was the source of NMI"/>
        </bitfield>
    </register>
    <register id="SYS_WDTRESET_CTL" width="32" offset="0x8" internal="0" description="Watchdog Reset Control Register">
        <bitfield id="TIMEOUT" description="WDT timeout reset type" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SOFT" value="0x0" description="WDT timeout event generates Soft reset"/>
            <bitenum id="HARD" value="0x1" description="WDT timeout event generates Hard reset"/>
        </bitfield>
        <bitfield id="VIOLATION" description="WDT password violation reset type" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SOFT" value="0x0" description="WDT password violation event generates Soft reset"/>
            <bitenum id="HARD" value="0x1" description="WDT password violation event generates Hard reset"/>
        </bitfield>
    </register>
    <register id="SYS_PERIHALT_CTL" width="32" offset="0xC" internal="0" description="Peripheral Halt Control Register">
        <bitfield id="HALT_T16_0" description="Freezes IP operation when CPU is halted" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T16_1" description="Freezes IP operation when CPU is halted" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_1_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_1_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T16_2" description="Freezes IP operation when CPU is halted" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_2_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_2_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T16_3" description="Freezes IP operation when CPU is halted" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_3_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_3_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T32_0" description="Freezes IP operation when CPU is halted" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="HALT_T32_0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T32_0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA0" description="Freezes IP operation when CPU is halted" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA1" description="Freezes IP operation when CPU is halted" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA1_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA1_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA2" description="Freezes IP operation when CPU is halted" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA2_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA2_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA3" description="Freezes IP operation when CPU is halted" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA3_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA3_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB0" description="Freezes IP operation when CPU is halted" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB1" description="Freezes IP operation when CPU is halted" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB1_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB1_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB2" description="Freezes IP operation when CPU is halted" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB2_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB2_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB3" description="Freezes IP operation when CPU is halted" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB3_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB3_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_ADC" description="Freezes IP operation when CPU is halted" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="HALT_ADC_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_ADC_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_WDT" description="Freezes IP operation when CPU is halted" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="HALT_WDT_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_WDT_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_DMA" description="Freezes IP operation when CPU is halted" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="HALT_DMA_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_DMA_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
    </register>
    <register id="SYS_SRAM_SIZE" width="32" offset="0x10" internal="0" description="SRAM Size Register">
    </register>
    <register id="SYS_SRAM_BANKEN" width="32" offset="0x14" internal="0" description="SRAM Bank Enable Register">
        <bitfield id="BNK0_EN" description="SRAM Bank0 enable" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BNK1_EN" description="SRAM Bank1 enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank1 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank1 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK2_EN" description="SRAM Bank1 enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank2 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank2 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK3_EN" description="SRAM Bank1 enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank3 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank3 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK4_EN" description="SRAM Bank1 enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank4 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank4 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK5_EN" description="SRAM Bank1 enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank5 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank5 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK6_EN" description="SRAM Bank1 enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank6 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank6 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK7_EN" description="SRAM Bank1 enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables Bank7 of the SRAM"/>
            <bitenum id="ENABLE" value="0x1" description="Enables Bank7 of the SRAM"/>
        </bitfield>
        <bitfield id="SRAM_RDY" description="SRAM ready" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="SRAM_RDY_0" value="0x0" description="SRAM is not ready for accesses. Banks are undergoing an enable or disable sequence, and reads or writes to SRAM are stalled until the banks are ready"/>
            <bitenum id="SRAM_RDY_1" value="0x1" description="SRAM is ready for accesses. All SRAM banks are enabled/disabled according to values of bits 7:0 of this register"/>
        </bitfield>
    </register>
    <register id="SYS_SRAM_BANKRET" width="32" offset="0x18" internal="0" description="SRAM Bank Retention Control Register">
        <bitfield id="BNK0_RET" description="Bank0 retention" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BNK1_RET" description="Bank1 retention" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BNK1_RET_0" value="0x0" description="Bank1 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK1_RET_1" value="0x1" description="Bank1 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BNK2_RET" description="Bank2 retention" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BNK2_RET_0" value="0x0" description="Bank2 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK2_RET_1" value="0x1" description="Bank2 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BNK3_RET" description="Bank3 retention" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BNK3_RET_0" value="0x0" description="Bank3 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK3_RET_1" value="0x1" description="Bank3 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BNK4_RET" description="Bank4 retention" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BNK4_RET_0" value="0x0" description="Bank4 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK4_RET_1" value="0x1" description="Bank4 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BNK5_RET" description="Bank5 retention" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BNK5_RET_0" value="0x0" description="Bank5 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK5_RET_1" value="0x1" description="Bank5 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BNK6_RET" description="Bank6 retention" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BNK6_RET_0" value="0x0" description="Bank6 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK6_RET_1" value="0x1" description="Bank6 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BNK7_RET" description="Bank7 retention" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BNK7_RET_0" value="0x0" description="Bank7 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BNK7_RET_1" value="0x1" description="Bank7 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="SRAM_RDY" description="SRAM ready" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="SRAM_RDY_0" value="0x0" description="SRAM banks are being set up for retention. Entry into LPM3, LPM4 should not be attempted until this bit is set to 1"/>
            <bitenum id="SRAM_RDY_1" value="0x1" description="SRAM is ready for accesses. All SRAM banks are enabled/disabled for retention according to values of bits 7:0 of this register"/>
        </bitfield>
    </register>
    <register id="SYS_FLASH_SIZE" width="32" offset="0x20" internal="0" description="Flash Size Register">
    </register>
    <register id="SYS_DIO_GLTFLT_CTL" width="32" offset="0x30" internal="0" description="Digital I/O Glitch Filter Control Register">
        <bitfield id="GLTCH_EN" description="Glitch filter enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="GLTCH_EN_0" value="0x0" description="Disables glitch filter on the digital I/Os"/>
            <bitenum id="GLTCH_EN_1" value="0x1" description="Enables glitch filter on the digital I/Os"/>
        </bitfield>
    </register>
    <register id="SYS_SECDATA_UNLOCK" width="32" offset="0x40" internal="0" description="IP Protected Secure Zone Data Access Unlock Register">
        <bitfield id="UNLKEY" description="Unlock key" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_MASTER_UNLOCK" width="32" offset="0x1000" internal="0" description="Master Unlock Register">
        <bitfield id="UNLKEY" description="Unlock Key" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_BOOTOVER_REQ0" width="32" offset="0x1004" internal="0" description="Boot Override Request Register">
    </register>
    <register id="SYS_BOOTOVER_REQ1" width="32" offset="0x1008" internal="0" description="Boot Override Request Register">
    </register>
    <register id="SYS_BOOTOVER_ACK" width="32" offset="0x100C" internal="0" description="Boot Override Acknowledge Register">
    </register>
    <register id="SYS_RESET_REQ" width="32" offset="0x1010" internal="0" description="Reset Request Register">
        <bitfield id="POR" description="Generate POR" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="REBOOT" description="Generate Reboot_Reset" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WKEY" description="Write key" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_RESET_STATOVER" width="32" offset="0x1014" internal="0" description="Reset Status and Override Register">
        <bitfield id="SOFT" description="Indicates if SOFT Reset is active" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="HARD" description="Indicates if HARD Reset is active" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="REBOOT" description="Indicates if Reboot Reset is active" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOFT_OVER" description="SOFT_Reset overwrite request" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HARD_OVER" description="HARD_Reset overwrite request" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RBT_OVER" description="Reboot Reset overwrite request" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
    </register>
</module>
